Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: This means that starting the program again using Run/Continue, Animate or Step will start the program from the beginning.
it_it: Ciò significa che riavviando il programma tramite Run/Continue, Animate o Step, il programma verrà riavviato dall'inizio.

source: This means that the modified value has not yet been sent to the module.
it_it: Ciò significa che il valore modificato non è ancora stato inviato al modulo.

source: This means that the value entered will be written to the corresponding object by pressing the Return key or the Enter key.
it_it: Ciò significa che il valore inserito verrà scritto nell'oggetto corrispondente premendo il tasto Return o Enter.

source: This means that there is effectively no vibration at this velocity.
it_it: Ciò significa che a questa velocità non si verificano praticamente vibrazioni.

source: This means that when generating a DCF file using the Device Configuration tool the last entered value of this object will also be written to the DCF file.
it_it: Ciò significa che quando si genera un file DCF utilizzando il tool Device Configuration, anche l'ultimo valore immesso per questo oggetto verrà scritto nel file DCF.

source: This normally is only relevant if the update should go wrong, so that TRINAMIC can analyze the problem.
it_it: Questo solitamente è rilevante solo se l'aggiornamento non va a buon fine, in modo che TRINAMIC possa analizzare il problema.

source: This option should normally be switched on.
it_it: Normalmente, questa opzione dovrebbe essere attivata.

source: This product documentation is related and/or associated with additional tool kits, firmware and other items, as provided on the product page at: www.analog.com.
it_it: La presente documentazione di prodotto è correlata e/o associata a kit di strumenti aggiuntivi, firmware e altri articoli, come indicato nella pagina del prodotto all'indirizzo: www.analog.com.

source: This provides some general information about the connected module as well as the possibility to send NMT commands to this module only.
it_it: Questo fornisce alcune informazioni generali sul modulo connesso e la possibilità di inviare comandi NMT solo a questo modulo.

source: This reply datagram will be displayed here.
it_it: Questo datagramma di risposta verrà visualizzato qui.

source: This results in the fact that pulse divisor and/or ramp divisor also get changed.
it_it: Ciò comporta che anche il divisore di impulsi e/o il divisore di rampa vengano modificati.

source: This section defines the syntax of the TMCL commands used in the TMCL Creator.
it_it: Questa sezione definisce la sintassi dei comandi TMCL utilizzati in TMCL Creator

source: This should normally be the same on all modules.
it_it: Normalmente dovrebbe essere lo stesso per tutti i moduli.

source: This tool can be used with all devices that support saving parameters to non-volatile memory.
it_it: Questo tool può essere utilizzato con tutti i dispositivi che supportano il salvataggio dei parametri nella memoria non volatile.

source: This tool consists of a graph that shows the load value (blue line) and the motor current value (red line) and three tabs which concern different aspects of these features:
it_it: Questo strumento è costituito da un grafico che mostra il valore del carico (linea blu) e il valore della corrente del motore (linea rossa) e tre schede che riguardano diversi aspetti di queste funzionalità:

source: This tool helps to find the best settings for using stall detection.
it_it: Questo strumento aiuta a trovare le impostazioni migliori per l'utilizzo del rilevamento dello stallo.

source: This tool helps to find the necessary motor parameters when StallGuard is to be used.
it_it: Questo tool aiuta a trovare i parametri motore necessari quando si utilizza StallGuard.

source: This tool is provided for BLDC motor modules.
it_it: Questo tool è disponibile per i moduli motore BLDC.

source: This tool is provided for all modules that support axis parameters (which most of the TRINAMIC modules do).
it_it: Questo tool è disponibile per tutti i moduli che supportano i parametri degli assi (come la maggior parte dei moduli TRINAMIC).

source: This tool is provided for all modules that support stand-alone TMCL programming.
it_it: Questo strumento è disponibile per tutti i moduli che supportano la programmazione TMCL stand-alone.

source: This tool provides some information about the connected evaluation board itself.
it_it: Questo tool fornisce alcune informazioni sulla evaluation board collegata.

source: This tool provides some information about the connected module itself.
it_it: Questo strumento fornisce alcune informazioni sul modulo connesso.

source: This tool provides the following functions:
it_it: Questo strumento fornisce le seguenti funzioni:

source: This value is cyclically read from the chip and updated here.
it_it: Questo valore viene letto ciclicamente dal chip e aggiornato qui.

source: This way it is possible to automatically watch the contents of local variables which can be very useful for debugging a TMCL/PC program.
it_it: In questo modo è possibile monitorare automaticamente il contenuto delle variabili locali, il che può essere molto utile per il debug di un programma TMCL/PC.

source: This way, other non-CANopen traffic on the same bus (for example TMCL messages) can be masked out from the CANopen tools.
it_it: In questo modo, altro traffico non CANopen sullo stesso bus (ad esempio messaggi TMCL) può essere mascherato dagli strumenti CANopen.

source: This way, the device configuration tool can also be used as a simple DCF file editor.
it_it: In questo modo, lo strumento di configurazione del dispositivo può essere utilizzato anche come un semplice editor di file DCF.

source: This will stop polling values from the module.
it_it: Questo interromperà il polling dei valori dal modulo.

source: Those are the same as menu bar’s tools.
it_it: Questi sono gli stessi strumenti della barra dei menù.

source: Three colors are used:
it_it: Vengono utilizzati tre colori:

source: Threshold speed (SAP 182): CoolStep will become active when the actual velocity of the motor is above this value.
it_it: Threshold speed (SAP 182): CoolStep si attiverà quando la velocità effettiva del motore è superiore a questo valore.

source: Thus, also for each Trinamic CANopen module an EDS file is provided on the Trinamic website.
it_it: Pertanto, anche per ogni modulo CANopen Trinamic è disponibile un file EDS sul sito web di Trinamic.

source: Thus, trademark designations and symbols are only entered in the Short Spec of this document that introduces the product at a quick glance.
it_it: Pertanto, le designazioni di marchi e i simboli vengono inseriti solo nella sezione "Sintesi" di questo documento, che presenta il prodotto in modo rapido e intuitivo.

source: To Write value: The contents of registers that are writable are shown here.
it_it: To Write value: Il contenuto dei registri scrivibili è mostrato qui.

source: To change a parameter, click on its value.
it_it: Per modificare un parametro, cliccare sul suo valore.

source: To change its contents, enter a new value in the input field on the right hand side beneath the Change button.
it_it: Per modificarne il contenuto, immettere un nuovo valore nel campo di input a destra, sotto il pulsante Change.

source: To check if the library is installed, refer to library installation procedure
it_it: Per verificare se la libreria è installata, fare riferimento alla procedura di installazione delle librerie

source: To do this, select the Download function.
it_it: Per farlo, selezionare la funzione Download.

source: To generate a DCF file using this tool, first fill in the Description, Created by and Modified by fields with meaningful values.
it_it: Per generare un file DCF utilizzando questo strumento, compilare innanzitutto i campi Description, Created by e Modified by con valori significativi.

source: To have a unique tool for both protocols, the CANopen tools have also been integrated into the TMCL-IDE.
it_it: Per disporre di uno strumento unico per entrambi i protocolli, gli strumenti CANopen sono stati integrati anche in TMCL-IDE.

source: To install library, please refer to video reference
it_it: Per installare la libreria, consultarere il video di riferimento

source: To install the Arduino-ESP32 tutorial, please refer to Arduino board manager tutorial
it_it: Per installare il tutorial Arduino-ESP32, fare riferimento al tutorial Arduino Board Manager.

source: To map an object to the selected RPDO, select the desired object from the list of mappable objects.
it_it: Per mappare un oggetto all'RPDO selezionato, selezionare l'oggetto desiderato dall'elenco degli oggetti mappabili.

source: To map an object to the selected TPDO, select the desired object from the list of mappable objects.
it_it: Per mappare un oggetto sul TPDO selezionato, selezionarlo dall'elenco degli oggetti mappabili.

source: To remove an object from the selected RPDO, select it in the list of mapped objects and click the right arrow button or double click the object.
it_it: Per rimuovere un oggetto dall'RPDO selezionato, selezionarlo nell'elenco degli oggetti mappati e cliccare sul pulsante freccia destra oppure doppio clic sull'oggetto.

source: To remove an object mapping from the selected TPDO, select it in the list of mapped objects and click the right arrow button or double click the object.
it_it: Per rimuovere la mappatura di un oggetto dal TPDO selezionato, selezionarlo nell'elenco degli oggetti mappati e cliccare sul pulsante freccia destra o doppio clic sull'oggetto.

source: To set up the CoolStep parameters, first run the motor at the desired velocity using the Velocity Mode tool.
it_it: Per impostare i parametri CoolStep, avviare prima il motore alla velocità desiderata utilizzando il tool Velocity Mode.

source: To set up the StallGuard2 parameters, first run the motor at the desired velocity using the Velocity Mode tool.
it_it: Per impostare i parametri di StallGuard2, avviare prima il motore alla velocità desiderata utilizzando il tool Velocity Mode.

source: To start the debugger either selecting Debugger active in the Debug menu or click the Debugger icon on the tool bar.
it_it: Per avviare il debugger, selezionare Debugger active nel menù Debug oppure cliccando sull'icona Debugger sulla barra degli strumenti.

source: To use a DCF file (either generated by this tool or by other tools), either click the Import from DCF button or click the Import from DCF and save to NVM button.
it_it: Per utilizzare un file DCF (generato da questo strumento o da altri), cliccare sul pulsante Import from DCF oppure sul pulsante Import from DCF and save to NVM.

source: To use a wizard, first click the wizard icon on the tool bar to open the wizard selection window.
it_it: Per utilizzare una procedura guidata, cliccare sull'icona del "wizard" sulla barra degli strumenti per aprire la finestra di selezione della procedura guidata.

source: To use this feature, check the Use Limits checkbox and enter position limits.
it_it: Per utilizzare questa funzione, selezionare la checkbox "Use Limits" e immettere i limiti di posizione.

source: To use this tool, first run the motor at the desired velocity using the Velocity Mode tool.
it_it: Per utilizzare questo tool, prima di tutto, far girare il motore alla velocità desiderata utilizzando il tool Velocity Mode.

source: Toggle the level switch to adjust the communication level to be consistent with the external equipment.
it_it: Azionare lo switch per regolare il livello di comunicazione in modo che sia coerente con l'apparecchiatura esterna.

source: Toggle the mode switch to adjust to the desired mode.
it_it: Azionare il selettore di modalità per impostare la modalità desiderata.

source: Tool Bar
it_it: Barra degli Strumenti

source: Tools that are not specific to a module or axis are called container tools.
it_it: Gli strumenti che non sono specifici di un modulo o di un asse sono chiamati tool contenitore.

source: Tools: Call container tools.
it_it: Tools: Richiama gli strumenti del contenitore.

source: Torque tuning
it_it: Regolazione della coppia

source: Touch clock pin
it_it: Pin di clock touch

source: Touch data pin
it_it: Pin dati touch

source: Touch interrupt pin
it_it: Pin di interrupt touch

source: Touch panel
it_it: Pannello touch

source: Touch panel connector
it_it: Connettore per pannello touch

source: Touch reset pin
it_it: Pin di reset touch

source: Touch screen interface: The interface used to connect the touch cable
it_it: Touch screen interface: L'interfaccia utilizzata per collegare il cavo touch

source: Touch type
it_it: Tipo touch

source: Touch version: 106.1×67.8mm
it_it: Versione touch: 106.1×67.8mm

source: Trademark Designations and Symbols
it_it: Designazioni e Simboli dei Marchi

source: Trademark designations and symbols used in this documentation indicate that a product or feature is owned and registered as trademark and/or patent either by ADI Trinamic or by other manufacturers, whose products are used or referred to in combination with ADI Trinamic’s products and ADI Trinamic’s product documentation.
it_it: Le designazioni di marchi e i simboli utilizzati in questa documentazione indicano che un prodotto o una funzionalità è di proprietà e registrato come marchio e/o brevetto da ADI Trinamic o da altri produttori, i cui prodotti sono utilizzati o citati in combinazione con i prodotti ADI Trinamic e la documentazione di prodotto ADI Trinamic.

source: Transmission type: the transmission type of the selected RPDO.
it_it: Transmission type: il tipo di trasmissione dell'RPDO selezionato.

source: Transmission type: the transmission type of the selected TPDO.
it_it: Transmission type: il tipo di trasmissione del TPDO selezionato.

source: Try running the motor at different speeds below and above each threshold to be sure that the motor runs stable with these settings.
it_it: Provare a far funzionare il motore a velocità diverse al di sotto e al di sopra di ciascuna soglia per assicurarsi che funzioni in modo stabile con queste impostazioni.

source: Turning off this option will select manual Y scaling.
it_it: Disattivando questa opzione si seleziona la scala Y manuale.

source: Turning on this option also considerably reduces the amount of data being displayed in the TMCL Log window.
it_it: L'attivazione di questa opzione riduce inoltre notevolmente la quantità di dati visualizzati nella finestra TMCL Log.

source: Type
it_it: Tipo

source: Type: The data type of the object.
it_it: Type: Il tipo di dati dell'oggetto.

source: UART Interface Usage
it_it: Utilizzo dell'Interfaccia UART

source: UART Interface Usage Demo
it_it: Demo di Utilizzo dell'Interfaccia UART

source: UART Self-Transmission and Reception Communication in Python IDLE
it_it: Auto-Trasmissione UART e ricezione della Comunicazione in Python IDLE

source: UART Self-Transmission and Reception Communication in SSCOM
it_it: Auto-Trasmissione UART e ricezione della Comunicazione in SSCOM

source: UART1.CTS (Used to indicate whether a command or data is being sent (required for OLEDs))
it_it: UART1.CTS (Utilizzato per indicare se viene inviato un comando o dei dati (obbligatorio per gli OLED))

source: UART1.RTS (Used to control OLEDs for reset (required for OLEDs))
it_it: UART1.RTS (Utilizzato per controllare il reset degli OLED (obbligatorio per gli OLED))

source: UART1.RTS (Used to control OLEDs for reset (required for OLEDs)）
it_it: UART1.RTS (Utilizzato per controllare il reset degli OLED (obbligatorio per gli OLED))

source: UFDRV <type>, <motor>, <value>, <module index>: special UF command for the motor driver connected to the Startrampe/Landungsbruecke.
it_it: UFDRV <type>, <motor>, <value>, <module index>: comando UF speciale per il driver motore collegato a Startrampe/Landungsbruecke.

source: UFMC <type>, <motor>, <value>, <module index>: special UF command for the motor controller connected to the Startrampe/Landungsbruecke.
it_it: UFMC <type>, <motor>, <value>, <module index>: comando UF speciale per il controller motore collegato a Startrampe/Landungsbruecke.

source: URAT0.GND (Used to indicate whether a command or data is being sent (required for OLEDs))
it_it: URAT0.GND (Utilizzato per indicare se viene inviato un comando o dei dati (necessario per gli OLED))

source: USB TO RS485 Bidirectional Converter x1
it_it: Convertitore bidirezionale da USB a RS485 x 1

source: USB TO UART Type-C port
it_it: Porta USB-UART Type-C

source: USB TO UART/I2C/SPI/JTAG
it_it: Da USB a UART/I2C/SPI/JTAG

source: USB TO UART/I2C/SPI/JTAG firmware package
it_it: Pacchetto firmware USB TO UART/I2C/SPI/JTAG

source: USB TO UART/I2C/SPI/JTAG is a high-speed USB bus adapter device that supports USB to 2-ch UART, USB to 1-ch UART + 1-ch I2C + 1-ch SPI, USB to 1-ch UART + 1-ch JTAG.
it_it: "USB TO UART/I2C/SPI/JTAG" è un dispositivo adattatore di bus USB ad alta velocità che supporta da USB a 2-can. UART, da USB a 1-can. UART + 1-can. I2C + 1-can. SPI, da USB a 1-can. UART + 1-can. JTAG.

source: USB Type-C interface
it_it: Interfaccia USB Type-C

source: USB cable (Type-A to Type-C) x 1
it_it: Cavo USB (da Tipo A a Tipo C) x 1

source: USB interface: Used for power supply and flashing
it_it: USB interface: Utilizzata per l'alimentazione e il flashing

source: USB port, 5V
it_it: Porta USB, 5V

source: USB power is not sufficient for powering motors, so it will always be necessary to connect the module also to a power supply in order to be able to run a motor using USB connection.
it_it: L'alimentazione USB non è sufficiente per alimentare i motori, quindi sarà sempre necessario collegare il modulo anche a un alimentatore per poter azionare un motore tramite connessione USB.

source: USB to CAN adapter analyzer x1
it_it: Analizzatore adattatore da USB a CAN x 1

source: USB to UART chip
it_it: chip da USB a UART

source: Uncheck this checkbox if the object is not to be written to the DCF file.
it_it: Deselezionare questa checkbox se l'oggetto non deve essere scritto nel file DCF.

source: Under normal circumstances it is not necessary to make changes here.
it_it: In circostanze normali, non è necessario apportare modifiche.

source: Under normal circumstances, the evaluation boards are detected automatically.
it_it: In circostanze normali, le evaluation board vengono rilevate automaticamente.

source: Unlike torque and velocity tuning, the position has only P parameter that needs to be tuned.
it_it: A differenza della regolazione di coppia e velocità, la posizione ha solo il parametro P che deve essere regolato.

source: Unzip the provided development board package
it_it: Decomprimere il pacchetto della board di sviluppo fornito

source: Update Firmware
it_it: Aggiornamento del Firmware

source: Usage Instructions
it_it: Istruzioni per l'uso

source: Use "flash probe 0" to scan the flash.
it_it: Usare "flash probe 0" per scansionare la flash.

source: Use "help" to check all supported commands
it_it: Usare "help" per verificare tutti i comandi supportati

source: Use "i2cconfig" to configure your I2C bus
it_it: Usare "i2cconfig" per configurare il bus I2C

source: Use "i2cdetect" to scan the devices on the bus
it_it: Usare "i2cdetect" per scansionare i dispositivi sul bus

source: Use "i2cdump" to dump all registers (experiment)
it_it: Usare "i2cdump" per eseguire il dump di tutti i registri (esperimento)

source: Use "i2cget" to retrieve the content of a specific register
it_it: Usare "i2cget" per recuperare il contenuto di un registro specifico

source: Use "i2cset" to set the value of a specific register
it_it: Usare "i2cset" per impostare il valore di un registro specifico

source: Use the Connect button to reconnect to the module after the connection had been closed using the Disconnect button.
it_it: Utilizzare il pulsante Connect per riconnettersi al modulo dopo aver chiuso la connessione tramite il pulsante Disconnect.

source: Use the Connection tab to make general settings for the connection and to connect to your devices attached to the CAN bus.
it_it: Utilizzare il tab Connection per configurare le impostazioni generali della connessione e per connettersi ai dispositivi collegati al bus CAN.

source: Use the Connection tab to make general settings for the connection and to connect to your module.
it_it: Utilizzare la scheda Connection per configurare le impostazioni generali per la connessione e per connettersi al modulo.

source: Use the NMT tab to send NMT commands to all devices connected to the CANopen network.
it_it: Utilizzare il tab NMT per inviare comandi NMT a tutti i dispositivi connessi alla rete CANopen.

source: Use the Object Browser to write the desired value to each object that is to be saved in the DCF file.
it_it: Utilizzare l'Object Browser per scrivere il valore desiderato su ciascun oggetto da salvare nel file DCF.

source: Use the Settings tab of the CAN connection window to control some general settings:
it_it: Utilizzare il tab Settings della finestra di connessione CAN per controllare alcune impostazioni generali:

source: Use the Settings tab of the CAN connection window to control the timer which is used for regularly polling values from the module.
it_it: Utilizzare il tab Settings della finestra di connessione CAN per controllare il timer utilizzato per interrogare regolarmente i valori del modulo.

source: Use the Settings tab of the USB connection window to control the regular polling of values from the module.
it_it: Utilizzare la scheda Settings della finestra di connessione USB per controllare il polling regolare dei valori dal modulo.

source: Use the Settings tab of the serial port connection window to control the regular polling of values from the module.
it_it: Utilizzare la scheda Settings della finestra di connessione della porta seriale per controllare il polling regolare dei valori dal modulo.

source: Use the Start button to start the timer.
it_it: Utilizzare il pulsante Start per avviare il timer.

source: Use the Stop button to stop the timer.
it_it: Utilizzare il pulsante Stop per arrestare il timer.

source: Use the Velocity Mode tool to run the motor at a specific velocity.
it_it: Utilizzare lo strumento Velocity Mode per far funzionare il motore a una velocità specifica.

source: Use the CoolStep tool to further parametrize CoolStep.
it_it: Usare il tool CoolStep er parametrizzare ulteriormente CoolStep.

source: Use the Clear button to clear the emergency log.
it_it: Utilizzare il pulsante Clear per cancellare il log di emergenza.

source: Use the IDF Demos
it_it: Utilizzo delle Demo IDF

source: Use the RPDO tab to view and to edit the RPDO definitions.
it_it: Utilizzare la scheda RPDO per visualizzare e modificare le definizioni RPDO.

source: Use the TPDO tab to view and to edit the TPDO definitions.
it_it: Utilizzare la scheda TPDO per visualizzare e modificare le definizioni dei TPDO.

source: Use the arrow buttons in the Motion section to control the motor:
it_it: Utilizzare i pulsanti freccia nella sezione Motion per controllare il motore:

source: Use the buttons in the Homing section to start or to interrupt the homing.
it_it: Utilizzare i pulsanti nella sezione Homing per avviare o interrompere l'homing.

source: Use the driver demo to operate permanently:
it_it: Utilizza il driver demo per operare in modo permanente:

source: Use the left arrow button to remove a module from the list of assigned modules (and to transfer it back to the list of available modules).
it_it: Utilizzare il pulsante freccia sinistra per rimuovere un modulo dall'elenco dei moduli assegnati (e per trasferirlo nuovamente all'elenco dei moduli disponibili).
